mykhani/STM32RTOS/include/gpio-pins/stm32f401re-gpio.h
/*******************************************************************************
 * Copyright (C) 2020, Yasir Khan <yasir_electronics@yahoo.com>
 * All rights reserved.
 * 
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 * 
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 * 
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 * 
 * 3. Neither the name of the copyright holder nor the names of its contributors
 *    may be used to endorse or promote products derived from this software
 *    without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 ******************************************************************************/
/*
 * stm32f401re-gpio.h
 *
 *  Created on: Aug 27, 2020
 *      Author: ykhan
 */

#ifndef GPIO_PINS_STM32F401RE_GPIO_H_
#define GPIO_PINS_STM32F401RE_GPIO_H_

#define PA0		0
#define PA1		1
#define PA2		2
#define PA3		3
#define PA4		4
#define PA5		5
#define PA6		6
#define PA7		7
#define PA8		8
#define PA9		9
#define PA10	10
#define PA11	11
#define PA12	12
#define PA13	13
#define PA14	14
#define PA15	15

#define PB0		16
#define PB1		17
#define PB2		18
#define PB3		19
#define PB4		20
#define PB5		21
#define PB6		22
#define PB7		23
#define PB8		24
#define PB9		25
#define PB10	26
#define PB11	27
#define PB12	28
#define PB13	29
#define PB14	30
#define PB15	31

#define PC0		32
#define PC1		33
#define PC2		34
#define PC3		35
#define PC4		36
#define PC5		37
#define PC6		38
#define PC7		39
#define PC8		40
#define PC9		41
#define PC10	42
#define PC11	43
#define PC12	44
#define PC13	45
#define PC14	46
#define PC15	47

#define PD0		48
#define PD1		49
#define PD2		50
#define PD3		51
#define PD4		52
#define PD5		53
#define PD6		54
#define PD7		55
#define PD8		56
#define PD9		57
#define PD10	58
#define PD11	59
#define PD12	60
#define PD13	61
#define PD14	62
#define PD15	63

#define PE0		64
#define PE1		65
#define PE2		66
#define PE3		67
#define PE4		68
#define PE5		69
#define PE6		70
#define PE7		71
#define PE8		72
#define PE9		73
#define PE10	74
#define PE11	75
#define PE12	76
#define PE13	77
#define PE14	78
#define PE15	79

#define PH0		80
#define PH1		81
#define PH2		82
#define PH3		83
#define PH4		84
#define PH5		85
#define PH6		86
#define PH7		87
#define PH8		88
#define PH9		89
#define PH10	90
#define PH11	91
#define PH12	92
#define PH13	93
#define PH14	94
#define PH15	95

#endif /* GPIO_PINS_STM32F401RE_GPIO_H_ */
